---
type: SATExportOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# SATExportOptions

`Autodesk.Revit.DB.SATExportOptions` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | SATExportOptions | — | `` |
| Constructor | SATExportOptions | — | `public SATExportOptions ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |